In [4]:
import pandas as pd

In [5]:
li=[3,4,5,6]
s=pd.Series(li, index=['a','b','c','d'])

In [7]:
s[1]

4

In [8]:
s['a']

3

In [12]:
d={"name":["sirisha"],
   'role':["software developer"],
   'location':["mysore"]}

In [13]:
df=pd.Series(d)
df

name                   [sirisha]
role        [software developer]
location                [mysore]
dtype: object

In [14]:
df[1]

['software developer']

In [17]:
ds=pd.DataFrame(d)
ds

      name                role location
0  sirisha  software developer   mysore

In [18]:
square=lambda n:n*n

In [19]:
square(5)

25

In [21]:
def square(n):
    return(n*n)
square(5)

25

In [22]:
even= lambda n:print(True) if(n%2==0) else print(False)

In [23]:
even(21)

False

In [24]:
l=["1","2","3","4"]
l=[int(value) for value in l]

In [25]:
l

[1, 2, 3, 4]

In [26]:
l=["1","2","3","4"]
l=[int(value)*int(value) for value in l] ##list comprehension

In [27]:
l

[1, 4, 9, 16]

In [1]:
li=[]

In [12]:
import pandas as pd

In [31]:
df1={"Id":[1,2,3,4],"Name":["priya","siri","jyothi","lakshmi"],"Education":["b.tech","b.tech","b.tech","b.tech"],
    "Location":["Chinnamushidiwada","Birla","maddilapalem","Birla"]}

In [32]:
a=pd.DataFrame(df1)

In [33]:
a

   Id     Name Education           Location
0   1    priya    b.tech  Chinnamushidiwada
1   2     siri    b.tech              Birla
2   3   jyothi    b.tech       maddilapalem
3   4  lakshmi    b.tech              Birla

In [34]:
df2={"Id":[2,3,4,5,6],
     "Name":["rishi","ratnakar","bilal","pradeep","praveen"],
     "Education":["b.tech","b.tech","b.tech","MCA","b.tech"],
    "Location":["kurmanpalem","kurmanpalem","maddilapalem","thatichetlapalem","kottavalsa"]}

In [35]:
b=pd.DataFrame(df2)

In [36]:
b

   Id      Name Education          Location
0   2     rishi    b.tech       kurmanpalem
1   3  ratnakar    b.tech       kurmanpalem
2   4     bilal    b.tech      maddilapalem
3   5   pradeep       MCA  thatichetlapalem
4   6   praveen    b.tech        kottavalsa

In [37]:
pd.merge(a,b,how="outer")

   Id      Name Education           Location
0   1     priya    b.tech  Chinnamushidiwada
1   2      siri    b.tech              Birla
2   3    jyothi    b.tech       maddilapalem
3   4   lakshmi    b.tech              Birla
4   2     rishi    b.tech        kurmanpalem
5   3  ratnakar    b.tech        kurmanpalem
6   4     bilal    b.tech       maddilapalem
7   5   pradeep       MCA   thatichetlapalem
8   6   praveen    b.tech         kottavalsa

In [38]:
pd.merge(a,b,how="inner",on="Id")

   Id   Name_x Education_x    Location_x    Name_y Education_y    Location_y
0   2     siri      b.tech         Birla     rishi      b.tech   kurmanpalem
1   3   jyothi      b.tech  maddilapalem  ratnakar      b.tech   kurmanpalem
2   4  lakshmi      b.tech         Birla     bilal      b.tech  maddilapalem

In [41]:
pd.merge(a,b,how="inner",on="Education")

    Id_x   Name_x Education         Location_x  Id_y    Name_y    Location_y
0      1    priya    b.tech  Chinnamushidiwada     2     rishi   kurmanpalem
1      1    priya    b.tech  Chinnamushidiwada     3  ratnakar   kurmanpalem
2      1    priya    b.tech  Chinnamushidiwada     4     bilal  maddilapalem
3      1    priya    b.tech  Chinnamushidiwada     6   praveen    kottavalsa
4      2     siri    b.tech              Birla     2     rishi   kurmanpalem
5      2     siri    b.tech              Birla     3  ratnakar   kurmanpalem
6      2     siri    b.tech              Birla     4     bilal  maddilapalem
7      2     siri    b.tech              Birla     6   praveen    kottavalsa
8      3   jyothi    b.tech       maddilapalem     2     rishi   kurmanpalem
9      3   jyothi    b.tech       maddilapalem     3  ratnakar   kurmanpalem
10     3   jyothi    b.tech       maddilapalem     4     bilal  maddilapalem
11     3   jyothi    b.tech       maddilapalem     6   praveen    kottavalsa
12     4  lakshmi    b.tech              Birla     2     rishi   kurmanpalem
13     4  lakshmi    b.tech              Birla     3  ratnakar   kurmanpalem
14     4  lakshmi    b.tech              Birla     4     bilal  maddilapalem
15     4  lakshmi    b.tech              Birla     6   praveen    kottavalsa

In [42]:
pd.merge(a,b,how="left",on="Id")

,Id,Name_x,Education_x,Location_x,Name_y,Education_y,Location_y
0,1,priya,b.tech,Chinnamushidiwada,NaN,NaN,NaN
1,2,siri,b.tech,Birla,rishi,b.tech,kurmanpalem
2,3,jyothi,b.tech,maddilapalem,ratnakar,b.tech,kurmanpalem
3,4,lakshmi,b.tech,Birla,bilal,b.tech,maddilapalem

In [43]:
pd.merge(a,b,how="right",on="Id")

,Id,Name_x,Education_x,Location_x,Name_y,Education_y,Location_y
0,2,siri,b.tech,Birla,rishi,b.tech,kurmanpalem
1,3,jyothi,b.tech,maddilapalem,ratnakar,b.tech,kurmanpalem
2,4,lakshmi,b.tech,Birla,bilal,b.tech,maddilapalem
3,5,NaN,NaN,NaN,pradeep,MCA,thatichetlapalem
4,6,NaN,NaN,NaN,praveen,b.tech,kottavalsa

In [44]:
d1={"Name":["Jyothi","sirisha","priya","lakshmi","santhoshi"],
   "salary":[50000,90000,40000,60000,50000],
    "company":["Accenture","Infosys","Wipro","Google","Microsoft"]}

In [45]:
d=pd.DataFrame(d1)

In [46]:
d

        Name  salary    company
0     Jyothi   50000  Accenture
1    sirisha   90000    Infosys
2      priya   40000      Wipro
3    lakshmi   60000     Google
4  santhoshi   50000  Microsoft

In [16]:
d_group=d.groupby("salary").groups

In [17]:
d_group

{40000: Int64Index([2], dtype='int64'),
 50000: Int64Index([0, 4], dtype='int64'),
 60000: Int64Index([3], dtype='int64'),
 90000: Int64Index([1], dtype='int64')}

In [18]:
for i in d_group:
    print(i)

40000
50000
60000
90000

In [20]:
d_group=d.groupby("salary")

In [21]:
for i,j in d_group:
    print(i)
    print(j)

40000
    Name  salary company
2  priya   40000   Wipro
50000
        Name  salary    company
0     Jyothi   50000  Accenture
4  santhoshi   50000  Microsoft
60000
      Name  salary company
3  lakshmi   60000  Google
90000
      Name  salary  company
1  sirisha   90000  Infosys

In [33]:
d_group=d.groupby("Name")

In [29]:
d_group=d.groupby("Name").groups
d_group

{'Jyothi': Int64Index([0], dtype='int64'),
 'lakshmi': Int64Index([3], dtype='int64'),
 'priya': Int64Index([2], dtype='int64'),
 'santhoshi': Int64Index([4], dtype='int64'),
 'sirisha': Int64Index([1], dtype='int64')}

In [34]:
d_group.get_group("sirisha")

      Name  salary  company
1  sirisha   90000  Infosys

In [36]:
print(d_group.get_group("sirisha").to_string(index=False))

    Name  salary  company
 sirisha   90000  Infosys

In [63]:
d2={"Name":["Jyothi","sirisha","priya","lakshmi","santhoshi","Jyothi"],
   "salary":[50000,90000,40000,60000,50000,70000],
    "company":["Accenture","Infosys","Wipro","Google","Microsoft","Accenture"]}

In [64]:
d=pd.DataFrame(d2)
d

        Name  salary    company
0     Jyothi   50000  Accenture
1    sirisha   90000    Infosys
2      priya   40000      Wipro
3    lakshmi   60000     Google
4  santhoshi   50000  Microsoft
5     Jyothi   70000  Accenture

In [65]:
import pandas as pd
import numpy as n

In [71]:
d_group=d.groupby("Name")
d_group

In [72]:
d_group.agg(n.sum)

           salary
Name
Jyothi     120000
lakshmi     60000
priya       40000
santhoshi   50000
sirisha     90000

In [73]:
d_group.agg([n.sum,n.mean])

           salary
              sum   mean
Name
Jyothi     120000  60000
lakshmi     60000  60000
priya       40000  40000
santhoshi   50000  50000
sirisha     90000  90000